app/controllers/registrations_controller.rb

INSERT INTO `users` (`created_at`, `email`, `encrypted_password`, `first_name`, `last_name`, `updated_at`) VALUES ('2015-09-19 08:24:58', 'vinay@kreatio.com', '$2a$10$Bd0fkoXZbU4YfXTScqf26O1KfSdOMag7kNqgwXcmlYqYzHZieuhXG', 'vinay', 'kumar', '2015-09-19 08:24:58')
SELECT  `secret_codes`.* FROM `secret_codes`  WHERE `secret_codes`.`id` = 0 LIMIT 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `secret_codes` SET `updated_at` = '2015-09-19 09:14:00', `user_id` = 7 WHERE `secret_codes`.`id` = 3
---
  def create
    @user = User.new(sign_up_params)
     if @user.save
         SecretCode.find(params[:secret_code][:id]).update_attributes(user_id: @user.id)