app/controllers/secret_codes_controller.rb

SELECT  `secret_codes`.* FROM `secret_codes`   ORDER BY `secret_codes`.`id` ASC LIMIT 1
---
  def index
    @secret_codes = SecretCode.all

INSERT INTO `secret_codes` (`code`, `created_at`, `updated_at`) VALUES ('2c9f', '2015-09-18 20:53:50', '2015-09-18 20:53:50')
---
  def create
    if  params["create_secret_key_drop_down"].present?
      a = params["create_secret_key_drop_down"].to_i
      (1..a).each do
        @secret_code = SecretCode.new()
        @secret_code.code = SecretCode.new.generate_secret_code
        @secret_code.save

SELECT `secret_codes`.* FROM `secret_codes`
---
  def registered_user_information_json
    @data_hash = {}
    SecretCode.all.each do |secret|